-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/fumiyau/Documents/GitHub/JLPS-JSFS/JLPS_JSFS.log
  log type:  text
 opened on:   1 Oct 2018, 16:57:07

. set more off

. do "/Users/fumiyau/Documents/GitHub/JLPS-JSFS/1.DataConst-Wide.do"

. use "/Users/fumiyau/Desktop/SecondaryData/0417/data/pm7.dta", clear

. append using "/Users/fumiyau/Desktop/SecondaryData/0417/data/py7.dta"
(note: variable cq17iz was byte, now int to accommodate using data's values)
(label FQ61 already defined)
(label FQ60 already defined)
(label FQ59 already defined)
(label fq58_o already defined)
(label fq58_n already defined)
(label fq58_m already defined)
(label fq58_l already defined)
(label fq58_k already defined)
(label fq58_j already defined)
(label FQ58_I already defined)
(label FQ58_H already defined)
(label FQ58_G already defined)
(label FQ58_F already defined)
(label FQ58_E already defined)
(label FQ58_D already defined)
(label FQ58_C already defined)
(label FQ58_B already defined)
(label FQ58_A already defined)
(label FQ57_19S already defined)
(label FQ57_18R already defined)
(label FQ57_17Q already defined)
(label FQ57_16P already defined)
(label FQ57_15O already defined)
(label FQ57_14N already defined)
(label FQ57_13M already defined)
(label FQ57_12L already defined)
(label FQ57_11K already defined)
(label FQ57_10J already defined)
(label FQ57_09I already defined)
(label FQ57_08H already defined)
(label FQ57_07G already defined)
(label FQ57_06F already defined)
(label FQ57_05E already defined)
(label FQ57_04D already defined)
(label FQ57_03C already defined)
(label FQ57_02B already defined)
(label FQ57_01A already defined)
(label FQ56_3 already defined)
(label FQ56_2O already defined)
(label FQ56_2N already defined)
(label FQ56_2M already defined)
(label FQ56_2L already defined)
(label FQ56_2K already defined)
(label FQ56_2J already defined)
(label FQ56_2I already defined)
(label FQ56_2H already defined)
(label FQ56_2G already defined)
(label FQ56_2F already defined)
(label FQ56_2E already defined)
(label FQ56_2D already defined)
(label FQ56_2C already defined)
(label FQ56_2B already defined)
(label FQ56_2A already defined)
(label FQ56_1M already defined)
(label FQ56_1Y already defined)
(label FQ55 already defined)
(label FQ54_3N already defined)
(label FQ54_3M already defined)
(label FQ54_3L already defined)
(label FQ54_3K already defined)
(label FQ54_3J already defined)
(label FQ54_3I already defined)
(label FQ54_3H already defined)
(label FQ54_3G already defined)
(label FQ54_3F already defined)
(label FQ54_3E already defined)
(label FQ54_3D already defined)
(label FQ54_3C already defined)
(label FQ54_3B already defined)
(label FQ54_3A already defined)
(label FQ54_2 already defined)
(label FQ54_1 already defined)
(label FQ53EB already defined)
(label FQ53EA already defined)
(label FQ53DB already defined)
(label FQ53DA already defined)
(label FQ53E already defined)
(label FQ53D already defined)
(label FQ53C already defined)
(label FQ53B already defined)
(label FQ53A already defined)
(label FQ52 already defined)
(label FQ51_2O already defined)
(label FQ51_2N already defined)
(label FQ51_2M already defined)
(label FQ51_2L already defined)
(label FQ51_2K already defined)
(label FQ51_2J already defined)
(label FQ51_2I already defined)
(label FQ51_2H already defined)
(label FQ51_2G already defined)
(label FQ51_2F already defined)
(label FQ51_2E already defined)
(label FQ51_2D already defined)
(label FQ51_2C already defined)
(label FQ51_2B already defined)
(label FQ51_2A already defined)
(label FQ51_1BM already defined)
(label FQ51_1BY already defined)
(label FQ51_1BA already defined)
(label FQ51_1AM already defined)
(label FQ51_1AY already defined)
(label FQ51_1AA already defined)
(label FQ50 already defined)
(label FQ49M already defined)
(label FQ49Y already defined)
(label FQ49A already defined)
(label FQ48 already defined)
(label FQ47M already defined)
(label FQ47Y already defined)
(label FQ47 already defined)
(label FQ46F already defined)
(label FQ46E already defined)
(label FQ46D already defined)
(label FQ46C already defined)
(label FQ46B already defined)
(label FQ46A already defined)
(label FQ45_5 already defined)
(label FQ45_4Z already defined)
(label FQ45_4Y already defined)
(label FQ45_4X already defined)
(label FQ45_4M already defined)
(label FQ45_4A already defined)
(label FQ45_3 already defined)
(label fq45_2l already defined)
(label fq45_2c already defined)
(label FQ45_2 already defined)
(label FQ45_1 already defined)
(label FQ44 already defined)
(label FQ43S already defined)
(label FQ43 already defined)
(label FQ42S already defined)
(label FQ42 already defined)
(label FQ41E already defined)
(label FQ41D already defined)
(label FQ41C already defined)
(label FQ41B already defined)
(label FQ41A already defined)
(label FQ41 already defined)
(label FQ40 already defined)
(label FQ39_M already defined)
(label FQ39_L already defined)
(label FQ39_K already defined)
(label FQ39_J already defined)
(label FQ39_I already defined)
(label FQ39_H already defined)
(label FQ39_G already defined)
(label FQ39_F already defined)
(label FQ39_E already defined)
(label FQ39_D already defined)
(label FQ39_C already defined)
(label FQ39_B already defined)
(label FQ39_A already defined)
(label FQ38C already defined)
(label FQ38B already defined)
(label FQ38A already defined)
(label FQ37_2 already defined)
(label FQ37_1 already defined)
(label FQ36N already defined)
(label FQ36M already defined)
(label FQ36L already defined)
(label FQ36K already defined)
(label FQ36J already defined)
(label FQ36I already defined)
(label FQ36H already defined)
(label FQ36G already defined)
(label FQ36F already defined)
(label FQ36E already defined)
(label FQ36D already defined)
(label FQ36C already defined)
(label FQ36B already defined)
(label FQ36A already defined)
(label FQ35 already defined)
(label FQ34 already defined)
(label FQ33 already defined)
(label FQ32 already defined)
(label FQ31F already defined)
(label FQ31E already defined)
(label FQ31D already defined)
(label FQ31C already defined)
(label FQ31B already defined)
(label FQ31A already defined)
(label FQ30F already defined)
(label FQ30E already defined)
(label FQ30D already defined)
(label FQ30C already defined)
(label FQ30B already defined)
(label FQ30A already defined)
(label FQ29 already defined)
(label FQ28 already defined)
(label FQ27F already defined)
(label FQ27E already defined)
(label FQ27D already defined)
(label FQ27C already defined)
(label FQ27B already defined)
(label FQ27A already defined)
(label FQ26D already defined)
(label FQ26C already defined)
(label FQ26B already defined)
(label FQ26A already defined)
(label FQ25F already defined)
(label FQ25E already defined)
(label FQ25D already defined)
(label FQ25C already defined)
(label FQ25B already defined)
(label FQ25A already defined)
(label FQ24 already defined)
(label FQ23 already defined)
(label FQ22F already defined)
(label FQ22E already defined)
(label FQ22D already defined)
(label FQ22C already defined)
(label FQ22B already defined)
(label FQ22A already defined)
(label FQ21F already defined)
(label FQ21E already defined)
(label FQ21D already defined)
(label FQ21C already defined)
(label FQ21B already defined)
(label FQ21A already defined)
(label FQ20 already defined)
(label FQ19 already defined)
(label FQ18F already defined)
(label FQ18E already defined)
(label FQ18D already defined)
(label FQ18C already defined)
(label FQ18B already defined)
(label FQ18A already defined)
(label FQ17C already defined)
(label FQ17B already defined)
(label FQ17A already defined)
(label FQ16S already defined)
(label FQ16 already defined)
(label FQ15 already defined)
(label FQ14G already defined)
(label FQ14F already defined)
(label FQ14E already defined)
(label FQ14D already defined)
(label FQ14C already defined)
(label FQ14A already defined)
(label FQ14 already defined)
(label FQ13M_DN already defined)
(label FQ13M_D already defined)
(label FQ13M_C already defined)
(label FQ13M_B already defined)
(label FQ13M_A_2 already defined)
(label FQ13M_A_1 already defined)
(label FQ13M_A already defined)
(label FQ13F_DN already defined)
(label FQ13F_D already defined)
(label FQ13F_C already defined)
(label FQ13F_B already defined)
(label FQ13F_A_2 already defined)
(label FQ13F_A_1 already defined)
(label FQ13F_A already defined)
(label FQ12_8 already defined)
(label FQ12_7 already defined)
(label FQ12_6 already defined)
(label FQ12_5 already defined)
(label FQ12_4 already defined)
(label FQ12_3 already defined)
(label FQ12_2 already defined)
(label FQ12_1 already defined)
(label FQ11 already defined)
(label FQ10_2U already defined)
(label FQ10_2T already defined)
(label FQ10_2Q already defined)
(label FQ10_2P already defined)
(label FQ10_2O already defined)
(label FQ10_2N already defined)
(label FQ10_2M already defined)
(label FQ10_2L already defined)
(label FQ10_2K already defined)
(label FQ10_2J already defined)
(label FQ10_2I already defined)
(label FQ10_2H already defined)
(label FQ10_2G already defined)
(label FQ10_2F already defined)
(label FQ10_2E already defined)
(label FQ10_2D already defined)
(label FQ10_2C already defined)
(label FQ10_2B already defined)
(label FQ10_2A already defined)
(label FQ10_1 already defined)
(label FQ09_8F already defined)
(label FQ09_8E already defined)
(label FQ09_8D already defined)
(label FQ09_8C already defined)
(label FQ09_8B already defined)
(label FQ09_8A already defined)
(label FQ09_7F already defined)
(label FQ09_7E already defined)
(label FQ09_7D already defined)
(label FQ09_7C already defined)
(label FQ09_7B already defined)
(label FQ09_7A already defined)
(label FQ09_6F already defined)
(label FQ09_6E already defined)
(label FQ09_6D already defined)
(label FQ09_6C already defined)
(label FQ09_6B already defined)
(label FQ09_6A already defined)
(label FQ09_5F already defined)
(label FQ09_5E already defined)
(label FQ09_5D already defined)
(label FQ09_5C already defined)
(label FQ09_5B already defined)
(label FQ09_5A already defined)
(label FQ09_4F already defined)
(label FQ09_4E already defined)
(label FQ09_4D already defined)
(label FQ09_4C already defined)
(label FQ09_4B already defined)
(label FQ09_4A already defined)
(label FQ09_3F already defined)
(label FQ09_3E already defined)
(label FQ09_3D already defined)
(label FQ09_3C already defined)
(label FQ09_3B already defined)
(label FQ09_3A already defined)
(label FQ09_2F already defined)
(label FQ09_2E already defined)
(label FQ09_2D already defined)
(label FQ09_2C already defined)
(label FQ09_2B already defined)
(label FQ09_2A already defined)
(label FQ09_1F already defined)
(label FQ09_1E already defined)
(label FQ09_1D already defined)
(label FQ09_1C already defined)
(label FQ09_1B already defined)
(label FQ09_1A already defined)
(label FQ09S already defined)
(label FQ09 already defined)
(label FQ08D_I already defined)
(label FQ08D_H already defined)
(label FQ08D_G already defined)
(label FQ08D_F already defined)
(label FQ08D_E already defined)
(label FQ08D_D already defined)
(label FQ08D_C already defined)
(label FQ08D_B already defined)
(label FQ08D_A already defined)
(label FQ08C_I already defined)
(label FQ08C_H already defined)
(label FQ08C_G already defined)
(label FQ08C_F already defined)
(label FQ08C_E already defined)
(label FQ08C_D already defined)
(label FQ08C_C already defined)
(label FQ08C_B already defined)
(label FQ08C_A already defined)
(label FQ08B_I already defined)
(label FQ08B_H already defined)
(label FQ08B_G already defined)
(label FQ08B_F already defined)
(label FQ08B_E already defined)
(label FQ08B_D already defined)
(label FQ08B_C already defined)
(label FQ08B_B already defined)
(label FQ08B_A already defined)
(label FQ08A_I already defined)
(label FQ08A_H already defined)
(label FQ08A_G already defined)
(label FQ08A_F already defined)
(label FQ08A_E already defined)
(label FQ08A_D already defined)
(label FQ08A_C already defined)
(label FQ08A_B already defined)
(label FQ08A_A already defined)
(label FQ07L already defined)
(label FQ07K already defined)
(label FQ07J already defined)
(label FQ07I already defined)
(label FQ07H already defined)
(label FQ07G already defined)
(label FQ07F already defined)
(label FQ07E already defined)
(label FQ07D already defined)
(label FQ07C already defined)
(label FQ07B already defined)
(label FQ07A already defined)
(label FQ06DZ already defined)
(label FQ06DY already defined)
(label FQ06DX already defined)
(label FQ06D already defined)
(label FQ06CZ already defined)
(label FQ06CY already defined)
(label FQ06CX already defined)
(label FQ06C already defined)
(label FQ06BZ already defined)
(label FQ06BY already defined)
(label FQ06BX already defined)
(label FQ06B already defined)
(label FQ06AZ already defined)
(label FQ06AY already defined)
(label FQ06AX already defined)
(label FQ06A already defined)
(label FQ05_2M already defined)
(label FQ05_2L already defined)
(label FQ05_2K already defined)
(label FQ05_2J already defined)
(label FQ05_2I already defined)
(label FQ05_2H already defined)
(label FQ05_2G already defined)
(label FQ05_2F already defined)
(label FQ05_2E already defined)
(label FQ05_2D already defined)
(label FQ05_2C already defined)
(label FQ05_2B already defined)
(label FQ05_2A already defined)
(label FQ05 already defined)
(label FQ04_4 already defined)
(label FQ04_3N already defined)
(label FQ04_3M already defined)
(label FQ04_3L already defined)
(label FQ04_3K already defined)
(label FQ04_3J already defined)
(label FQ04_3I already defined)
(label FQ04_3H already defined)
(label FQ04_3G already defined)
(label FQ04_3F already defined)
(label FQ04_3E already defined)
(label FQ04_3D already defined)
(label FQ04_3C already defined)
(label FQ04_3B already defined)
(label FQ04_3A already defined)
(label FQ04_2 already defined)
(label FQ04_1I already defined)
(label FQ04_1H already defined)
(label FQ04_1G already defined)
(label FQ04_1F already defined)
(label FQ04_1E already defined)
(label FQ04_1D already defined)
(label FQ04_1C already defined)
(label FQ04_1B already defined)
(label FQ04_1A already defined)
(label FQ03_15 already defined)
(label FQ03_14S already defined)
(label FQ03_14 already defined)
(label FQ03_13 already defined)
(label FQ03_12 already defined)
(label FQ03_11 already defined)
(label FQ03_10 already defined)
(label FQ03_9 already defined)
(label FQ03_8 already defined)
(label FQ03_7 already defined)
(label fq03_6c already defined)
(label FQ03_5ES already defined)
(label FQ03_5DS already defined)
(label FQ03_5CS already defined)
(label FQ03_5BS already defined)
(label FQ03_5AS already defined)
(label FQ03_5F already defined)
(label FQ03_5E already defined)
(label FQ03_5D already defined)
(label FQ03_5C already defined)
(label FQ03_5B already defined)
(label FQ03_5A already defined)
(label FQ03_4M already defined)
(label FQ03_41 already defined)
(label FQ03_3 already defined)
(label fq03_2l already defined)
(label fq03_2c already defined)
(label FQ03_2 already defined)
(label FQ03_1 already defined)
(label FQ02_2 already defined)
(label FQ02_1 already defined)
(label FQ02 already defined)
(label FQSIZE already defined)
(label FQBLOCK already defined)
(label FQSURVEY already defined)
(label EQ67_1 already defined)
(label EQ66_2 already defined)
(label EQ66_1A already defined)
(label EQ64_3 already defined)
(label EQ64_2 already defined)
(label EQ64_1C already defined)
(label EQ64_1B already defined)
(label EQ64_1A already defined)
(label EQ64 already defined)
(label EQ63 already defined)
(label EQ61_1S already defined)
(label EQ59 already defined)
(label EQ57_1 already defined)
(label EQ56 already defined)
(label EQ48_1BA already defined)
(label EQ37 already defined)
(label EQ26 already defined)
(label EQ24 already defined)
(label EQ13_8 already defined)
(label EQ13_7 already defined)
(label EQ13_6 already defined)
(label EQ13_5 already defined)
(label EQ13_4 already defined)
(label EQ13_3 already defined)
(label EQ13_2 already defined)
(label EQ13_1 already defined)
(label eq12_210z already defined)
(label eq12_29z already defined)
(label eq12_28z already defined)
(label eq12_27z already defined)
(label eq12_26z already defined)
(label eq12_25z already defined)
(label eq12_24z already defined)
(label eq12_23z already defined)
(label eq12_22z already defined)
(label eq12_A already defined)
(label eq12_chd already defined)
(label eq12_fam already defined)
(label eq12_oth already defined)
(label eq12_num already defined)
(label EQ11S already defined)
(label EQ09A already defined)
(label EQ04_4 already defined)
(label EQ03_13 already defined)
(label EQ03_5ES already defined)
(label EQ03_5DS already defined)
(label EQ03_5CS already defined)
(label EQ03_5BS already defined)
(label EQ03_5AS already defined)
(label dq57d48 already defined)
(label dq57c48 already defined)
(label dq57b48 already defined)
(label dq57a24 already defined)
(label DQ54_4 already defined)
(label DQ49_2P already defined)
(label DQ48_1A already defined)
(label DQ46 already defined)
(label DQ44_5 already defined)
(label DQ41S already defined)
(label DQ39 already defined)
(label DQ33_2 already defined)
(label DQ33_1 already defined)
(label DQ26 already defined)
(label DQ17B already defined)
(label DQ17A already defined)
(label DQ16 already defined)
(label dq10_22z already defined)
(label DQ06_2G already defined)
(label DQ06_1G already defined)
(label DQ03_16SB already defined)
(label DQ03_16SA already defined)
(label DQ03_16A already defined)
(label DQ03_15A already defined)
(label DQ03_13 already defined)
(label DQ03_5ES already defined)
(label DQ03_5DS already defined)
(label DQ03_5CS already defined)
(label DQ03_5BS already defined)
(label DQ03_5AS already defined)
(label DQ03_41 already defined)
(label DQBLOCK already defined)
(label DQSURVEY already defined)
(label CQ49_1BA already defined)
(label CQ46_6 already defined)
(label CQ46_1 already defined)
(label CQ41 already defined)
(label cq34 already defined)
(label cq33 already defined)
(label cq31 already defined)
(label CQ24 already defined)
(label cq17bz already defined)
(label CQ07 already defined)
(label CQ06 already defined)
(label CQ04_2 already defined)
(label CQ03_5CS already defined)
(label CQSURVEY already defined)
(label BQ58 already defined)
(label BQ57 already defined)
(label BQ55A already defined)
(label BQ54_A already defined)
(label BQ52_1Y already defined)
(label BQ51 already defined)
(label BQ50_C already defined)
(label BQ48DA already defined)
(label BQ48A already defined)
(label BQ45A already defined)
(label BQ44_5 already defined)
(label BQ41 already defined)
(label BQ29 already defined)
(label BQ24A already defined)
(label BQ23E already defined)
(label BQ23D already defined)
(label BQ23C already defined)
(label BQ21 already defined)
(label BQ20 already defined)
(label BQ18 already defined)
(label BQ17B already defined)
(label BQ17A already defined)
(label BQ13_5 already defined)
(label BQ13_2BE already defined)
(label BQ13_2BB already defined)
(label BQ13_2BZ already defined)
(label BQ13_2BA already defined)
(label BQ13_2AA already defined)
(label BQ10A already defined)
(label BQ09_2A already defined)
(label BQ09_1A already defined)
(label BQ08B already defined)
(label BQ08A already defined)
(label BQ07_1G already defined)
(label BQ07_1C already defined)
(label BQ07_1 already defined)
(label BQ06A_3 already defined)
(label BQ_jobc already defined)
(label BQ03_13 already defined)
(label BQ03_12 already defined)
(label BQ03_11 already defined)
(label BQ03_7 already defined)
(label bq03_6c already defined)
(label BQ03_5ES already defined)
(label BQ03_5DS already defined)
(label BQ03_5CS already defined)
(label BQ03_5BS already defined)
(label BQ03_5AS already defined)
(label BQ03_1 already defined)
(label BQ02 already defined)
(label BQBLOCK already defined)
(label BQSURVEY already defined)
(label AQ61 already defined)
(label AQ55_4 already defined)
(label AQ55_1 already defined)
(label AQ53 already defined)
(label AQ52 already defined)
(label AQ51_1 already defined)
(label AQ51 already defined)
(label AQ48B already defined)
(label AQ48A already defined)
(label AQ47 already defined)
(label AQ43 already defined)
(label AQ42 already defined)
(label AQ40A already defined)
(label AQ39 already defined)
(label AQ35 already defined)
(label AQ32C already defined)
(label AQ32B already defined)
(label AQ32A already defined)
(label AQ30 already defined)
(label AQ29A already defined)
(label AQ27_1 already defined)
(label AQ24 already defined)
(label AQ22_4 already defined)
(label AQ22_3 already defined)
(label AQ22_1 already defined)
(label AQ21_4A already defined)
(label AQ21_2 already defined)
(label AQ21_1A already defined)
(label AQ19AG already defined)
(label AQ19AD already defined)
(label AQ19ACX already defined)
(label AQ19ABX already defined)
(label AQ19AA already defined)
(label AQ19 already defined)
(label AQ18 already defined)
(label AQ17_8 already defined)
(label AQ17_7 already defined)
(label AQ17_6 already defined)
(label AQ17_5 already defined)
(label AQ17_4 already defined)
(label AQ17_3 already defined)
(label AQ17_2 already defined)
(label AQ17_1 already defined)
(label AQ16 already defined)
(label AQ13 already defined)
(label AQ11_3 already defined)
(label aq11_21d already defined)
(label aq11_21a already defined)
(label AQ10A already defined)
(label AQ09A already defined)
(label AQ08AS already defined)
(label AQ08A already defined)
(label AQ08 already defined)
(label AQ07A already defined)
(label AQ05 already defined)
(label AQ03_11 already defined)
(label AQ03_10 already defined)
(label AQ03_9 already defined)
(label AQ03_8 already defined)
(label AQ03_7 already defined)
(label AQ03_5ES already defined)
(label AQ03_5DS already defined)
(label AQ03_5CS already defined)
(label AQ03_5BS already defined)
(label AQ03_5AS already defined)
(label AQ03_5A already defined)
(label AQ03_41 already defined)
(label AQ03_3S already defined)
(label AQ03_3 already defined)
(label AQ03_2S2 already defined)
(label AQ03_2 already defined)
(label AQ03_1S already defined)
(label AQ03_1 already defined)
(label AQSIZE already defined)
(label AQBLOCK already defined)
(label AQSURVEY already defined)
(label ZQ62 already defined)
(label ZQ59_3A already defined)
(label ZQ59_2Y already defined)
(label ZQ59_2N already defined)
(label ZQ58S already defined)
(label ZQ58 already defined)
(label ZQ57_2 already defined)
(label ZQ57_1 already defined)
(label ZQ56 already defined)
(label ZQ55_5 already defined)
(label ZQ55_4X already defined)
(label ZQ55_1 already defined)
(label ZQ54A already defined)
(label ZQ50 already defined)
(label ZQ49 already defined)
(label ZQ48_2 already defined)
(label ZQ47B already defined)
(label ZQ47A already defined)
(label ZQ46A already defined)
(label ZQ45S already defined)
(label ZQ45 already defined)
(label ZQ44 already defined)
(label ZQ43 already defined)
(label ZQ42 already defined)
(label ZQ41A already defined)
(label ZQ40A already defined)
(label ZQ38A already defined)
(label ZQ37 already defined)
(label ZQ36 already defined)
(label ZQ35 already defined)
(label ZQ34A already defined)
(label ZQ33A already defined)
(label ZQ32A already defined)
(label ZQ31A already defined)
(label ZQ30D already defined)
(label ZQ30A already defined)
(label ZQ29A already defined)
(label ZQ28 already defined)
(label ZQ27 already defined)
(label ZQ26A already defined)
(label ZQ25 already defined)
(label ZQ24 already defined)
(label ZQ23B already defined)
(label ZQ23A already defined)
(label ZQ22A4 already defined)
(label ZQ22A3 already defined)
(label ZQ22A1 already defined)
(label ZQ21 already defined)
(label ZQ20 already defined)
(label ZQ19 already defined)
(label ZQ17 already defined)
(label ZQ16 already defined)
(label ZQ14_32 already defined)
(label ZQ14C1D already defined)
(label ZQ14C1C already defined)
(label ZQ14C1B already defined)
(label ZQ14_3 already defined)
(label ZQ14FC already defined)
(label ZQ14FB already defined)
(label ZQ14FA already defined)
(label ZQ13_2A already defined)
(label ZQ13_1 already defined)
(label ZQ12 already defined)
(label ZQ11_A already defined)
(label ZQ10AS already defined)
(label ZQ10A already defined)
(label ZQ09A_A already defined)
(label ZQ08A already defined)
(label ZQ07C already defined)
(label ZQ07A already defined)
(label ZQ05_5N already defined)
(label ZQ05_5Y already defined)
(label ZQ05_4 already defined)
(label ZQ05_3S already defined)
(label ZQ05_3 already defined)
(label ZQ05_2 already defined)
(label ZQ05_1 already defined)
(label JC82M already defined)
(label JC82Y already defined)
(label JC82A already defined)
(label JC81Y already defined)
(label JC81A already defined)
(label JC_7A already defined)
(label JC_6 already defined)
(label JC_5C already defined)
(label JC_4W already defined)
(label JC_3 already defined)
(label JC_2C already defined)
(label JC_2L already defined)
(label JC_2 already defined)
(label JC_1 already defined)
(label ZQ03_3 already defined)
(label ZQ03_2 already defined)
(label ZQ03_1 already defined)
(label ZQ03 already defined)
(label zq02ay48 already defined)
(label ZQ02A already defined)
(label SIZE already defined)
(label BLOCK already defined)
(label sex already defined)

. ** Handling on wide data *********************************************************************************
. varcase _all

. varcase YBIRTH MBIRTH AQ11_21A AQ11_21B AQ11_21C AQ11_21D AQ11_21E AQ11_22A AQ11_22B AQ11_22C AQ11_22D AQ11_22E AQ11_23A AQ11_23B
>  AQ11_23C AQ11_23D AQ11_23E AQ11_24A AQ11_24B AQ11_24C AQ11_24D AQ11_24E AQ11_25A AQ11_25B AQ11_25C AQ11_25D AQ11_25E AQ11_26A AQ
> 11_26B AQ11_26C AQ11_26D AQ11_26E AQ11_27A AQ11_27B AQ11_27C AQ11_27D AQ11_27E AQ11_28A AQ11_28B AQ11_28C AQ11_28D AQ11_28E

. varcase DQ10_22Z DQ10_23Z DQ10_24Z DQ10_25Z EQ12_NUM EQ12_OTH EQ12_FAM EQ12_CHD DQ10_26Z DQ10_27Z DQ10_28Z DQ10_29Z DQ10_210Z CQ1
> 7BZ CQ17BB CQ17BC CQ17CZ CQ17CB CQ17CC CQ17DZ CQ17DB CQ17DC CQ17EZ CQ17EB CQ17EC CQ17FZ CQ17FB CQ17FC CQ17GZ CQ17GB CQ17GC CQ17HZ
>  CQ17HB CQ17HC CQ17IZ CQ17IB CQ17IC

. rename pANELid id

. rename SEX sex

. 
. /******働き方******/
. /*1"経営者、役員"2"正社員"3"パート、契約、臨時、嘱託"4"派遣"5"請負"6"自営"7"家族従業"8"内職"10"無職（学生除）"11"学生（働いていな
> い）"12"学生（現在非正規で働いている）"*/
. /*recode 1"正規雇用"2"非正規雇用"3"自営、家族従業"4"内職/無職"5"学生"*/
. /******本人******/
. rename jc_1 type1

. rename aq03_1 type2

. rename bq03_1 type3

. rename cq03_1 type4

. rename dq03_1 type5

. rename eq03_1 type6

. rename fq03_1 type7

. recode type* (1/2=1)(3/5=2)(6/7=3)(8=4)(9=.)(10=4)(11/12=5)(99=.)
(type1: 4731 changes made)
(type2: 3898 changes made)
(type3: 3536 changes made)
(type4: 3117 changes made)
(type5: 3244 changes made)
(type6: 3098 changes made)
(type7: 2992 changes made)

. /******配偶者******/
. rename zq55_1 sptype1

. rename aq55_1 sptype2

. rename bq44_1 sptype3

. rename cq46_2 sptype4

. rename dq44_1 sptype5

. rename eq42_1 sptype6

. rename fq45_1 sptype7

. 
. /****** 本人学歴 ******/
. /*w1時点で最後に通った学校が学歴となる*/
. /*元のコード：zq23a 1"中学"2"高校"3"専門"4"短大高専"5"大学"6"大学院"*/
. /*1"中学高校"2"専門3"短大高専"4"大学・大学院"."欠損値"*/
. gen redu = zq23a

. recode redu (1/2=1)(3=2)(4=3)(5/6=4)(7=.)(9=.)
(redu: 4715 changes made)

. 
. /****** generate marriage status ******/
. * 1"未婚"2"既婚"3"死別"4"離別"（w1）
. * 1"既婚"2"未婚"3"死別"4"離別"（w2-6）
. * w1をw2-6に合わせるかたちで修正
. rename zq50 marstat1

. recode marstat1 (1=2)(2=1)(3=3)(4=4)
(marstat1: 4637 changes made)

. rename aq52 marstat2

. rename bq42 marstat3

. rename cq45 marstat4

. rename dq43 marstat5

. rename eq41 marstat6

. rename fq44 marstat7

. 
. /****** w4配偶者学歴 ******/
. rename zq23b spedu1 

. recode spedu1 7=. 8=. 9=.
(spedu1: 2589 changes made)

. rename cq46_1 spedu4

. recode spedu4 7=. 8=.
(spedu4: 1335 changes made)

. gen spedu5 = dq48_2 
(1,483 missing values generated)

. replace spedu5 = spedu4 if marstat4==1 & marstat5==1 & (spedu5==8 | spedu5==9)
(1,658 real changes made, 4 to missing)

. gen spedu6 = eq47
(1,622 missing values generated)

. replace spedu6 = spedu5 if marstat5==1 & marstat6==1 & (spedu6==8 | spedu6==9)
(1,729 real changes made, 4 to missing)

. gen spedu7 = fq50
(1,724 missing values generated)

. replace spedu7 = spedu6 if marstat6==1 & marstat7==1 & (spedu7==8 | spedu7==9)
(1,741 real changes made, 4 to missing)

. 
. /*w2w3の学歴を埋める*/
. gen spedu2 =spedu1 if marstat1 == 1 & marstat2 ==1
(2,928 missing values generated)

. replace spedu2 =. if marstat2 == 2 | marstat2 == 3 | marstat2 == 4
(0 real changes made)

. replace spedu2 = spedu4 if (marstat1 == 2 | marstat1 == 3 | marstat1 == 4) & marstat2 == 1 & marstat4 == 1
(74 real changes made)

. 
. gen spedu3 =spedu1  if marstat1 == 1 & marstat3 ==1
(3,061 missing values generated)

. replace spedu3 =. if marstat3 == 2 | marstat3 == 3 | marstat3 == 4
(0 real changes made)

. replace spedu3 = spedu4 if (marstat1 == 2 | marstat1 == 3 | marstat1 == 4) & marstat3 == 1 & marstat4 == 1
(165 real changes made)

. 
. forvalues i=1/7{
  2. recode spedu`i' 7=. 8=. 9=. 99=.
  3. }
(spedu1: 0 changes made)
(spedu2: 0 changes made)
(spedu3: 0 changes made)
(spedu4: 1 changes made)
(spedu5: 1470 changes made)
(spedu6: 1342 changes made)
(spedu7: 1265 changes made)

. /******年収******/
. /*個人年収*/
. rename zq47a income1

. rename aq48a income2

. rename bq36a income3

. rename cq37a income4

. rename dq35a income5

. rename eq34a income6

. rename fq38a income7

. /*配偶者年収*/
. rename zq47b sincome1

. rename aq48b sincome2

. rename bq36b sincome3

. rename cq37b sincome4

. rename dq35b sincome5

. rename eq34b sincome6

. rename fq38b sincome7

. /*世帯年収*/
. rename zq47c hincome1

. rename aq48c hincome2

. rename bq36c hincome3

. rename cq37c hincome4

. rename dq35c hincome5

. rename eq34c hincome6

. rename fq38c hincome7

. 
. *世帯人員
. rename zq13_1 numberoffamily1

. rename aq11_1 numberoffamily2

. rename bq13_1 numberoffamily3

. rename cq17_1 numberoffamily4

. rename dq10_1 numberoffamily5

. rename eq12_1 numberoffamily6

. rename fq10_1 numberoffamily7

. 
. *子ども数
. /*wave1における子ども人数*/
. recode zq14_31 (88=0)(99=.),gen(numchild1)
(2846 differences between zq14_31 and numchild1)

. /*wave6-7における子ども人数*/
. recode eq11s (8=0)(9=.)(88=0)(99=.),gen(numchild6)
(1431 differences between eq11s and numchild6)

. recode fq09s (8=0)(9=.)(88=0)(99=.),gen(numchild7)
(1305 differences between fq09s and numchild7)

. 
. reshape long type marstat spedu income sincome hincome ychild sptype numchild numberoffamily, i(id) j(wave)
(note: j = 1 2 3 4 5 6 7)
(note: ychild1 not found)
(note: ychild2 not found)
(note: numchild2 not found)
(note: ychild3 not found)
(note: numchild3 not found)
(note: ychild4 not found)
(note: numchild4 not found)
(note: ychild5 not found)
(note: numchild5 not found)
(note: ychild6 not found)
(note: ychild7 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     4800   ->   33600
Number of variables                3461   ->    3413
j variable (7 values)                     ->   wave
xij variables:
                  type1 type2 ... type7   ->   type
         marstat1 marstat2 ... marstat7   ->   marstat
               spedu1 spedu2 ... spedu7   ->   spedu
            income1 income2 ... income7   ->   income
         sincome1 sincome2 ... sincome7   ->   sincome
         hincome1 hincome2 ... hincome7   ->   hincome
            ychild1 ychild2 ... ychild7   ->   ychild
            sptype1 sptype2 ... sptype7   ->   sptype
      numchild1 numchild2 ... numchild7   ->   numchild
numberoffamily1 numberoffamily2 ... numberoffamily7->numberoffamily
-----------------------------------------------------------------------------

. 
. 
. 
. 
. 
end of do-file

. do "/Users/fumiyau/Documents/GitHub/JLPS-JSFS/2.DataConst-Long.do" 

. drop if marstat ~= 1
(19,497 observations deleted)

. drop if numchild ==. & wave == 1
(1 observation deleted)

. drop if numchild ==. & wave == 7
(2 observations deleted)

. recode numberoffamily 99=.
(numberoffamily: 120 changes made)

. drop if numberoffamily == .
(120 observations deleted)

. /*Educaitonal assortative mating*/
. recode spedu  (1/2=1)(3=2)(4=3)(5/6=4)
(spedu: 12917 changes made)

. gen husedu = redu 
(26 missing values generated)

. replace husedu = spedu if sex == 2
(4,881 real changes made, 349 to missing)

. gen wifedu = redu 
(26 missing values generated)

. replace wifedu = spedu if sex == 1
(3,638 real changes made, 346 to missing)

. drop if husedu ==.
(362 observations deleted)

. drop if wifedu ==.
(359 observations deleted)

. gen husedu3 = husedu

. recode husedu3 (3=2) (4=3)
(husedu3: 6504 changes made)

. gen wifedu3 = wifedu

. recode wifedu3 (3=2) (4=3)
(wifedu3: 6322 changes made)

. *Create spouse paring patterns
. gen homogamy = 0

. recode homogamy 0 = 1 if husedu3 == 1 & wifedu3 == 1
(homogamy: 2356 changes made)

. recode homogamy 0 = 2 if husedu3 == 2 & wifedu3 == 2
(homogamy: 1450 changes made)

. recode homogamy 0 = 3 if husedu3 == 3 & wifedu3 == 3
(homogamy: 2321 changes made)

. recode homogamy 0 = 4 if husedu3 > wifedu3
(homogamy: 4494 changes made)

. recode homogamy 0 = 5 if husedu3 < wifedu3
(homogamy: 2638 changes made)

. label define  homogamyl 1 "低学歴同類婚" 2 "中学歴同類婚" 3 "高学歴同類婚" 4 "妻上昇婚" 5 "妻下降婚" 

. label values homogamy homogamyl

. recode homogamy 2=1 3=1 4=2 5=3,gen(xhom)
(10903 differences between homogamy and xhom)

. label define  hom3l 1 "同類婚" 2 "妻上昇婚" 3 "妻下降婚" 

. label values xhom hom3l

. *Generate spouse birth year
. gen spbirth=.
(13,259 missing values generated)

. replace spbirth=1900+zq52y if zq52a==1 & wave == 1
(479 real changes made)

. replace spbirth=1925+zq52y if zq52a==2 & wave == 1
(1,675 real changes made)

. by id: generate spbirth_w1 = sum(spbirth)

. 
. *generate age variables
. gen age = .
(13,259 missing values generated)

. replace age = 2007 + wave - 1 - ybirth if mbirth <= 3 & mbirth >= 1
(3,533 real changes made)

. replace age = 2007 + wave - 2 - ybirth if mbirth <= 12 & mbirth >= 4
(9,726 real changes made)

. 
. gen spage =. 
(13,259 missing values generated)

. replace spage = 2007 + wave - 2 - spbirth_w1 
(13,259 real changes made)

. replace spage = . if spage >= 2006
(1,956 real changes made, 1,956 to missing)

. 
. gen husage = age 

. replace husage = spage if sex == 2
(6,336 real changes made, 1,159 to missing)

. gen wifage = age 

. replace wifage = spage if sex == 1
(4,661 real changes made, 797 to missing)

. 
. /*従業上の地位_1"正規雇用"2"非正規雇用"3"自営、家族従業"4"内職/無職"5"学生"*/
. /*自営、家族従業、内職、学生、無職は除外*/
. /*recode type (1/2=1)(3/5=2)(6/7=3)(8=4)(9=.)(10=4)(11/12=5)(99=.)*/
. recode sptype (1/2=1)(3=2) (4/6=3)(7=4)(8=5)(9=.)(10=4)(88/99=.)
(sptype: 12785 changes made)

. 
. gen hustype = type
(30 missing values generated)

. replace hustype = sptype if sex == 2  
(5,722 real changes made, 43 to missing)

. gen wiftype = type 
(30 missing values generated)

. replace wiftype = sptype if sex == 1
(4,228 real changes made, 54 to missing)

. 
. drop if type == .
(30 observations deleted)

. drop if sptype == .
(97 observations deleted)

. drop if wiftype == 5
(25 observations deleted)

. drop if hustype == 5
(21 observations deleted)

. 
. /*本人、配偶者、世帯収入*/
. gen rpincomes = income

. recode rpincomes (1=0)(2=12.5)(3=50)(4=112.5)(5=200)(6=300)(7=400)(8=525)(9=725)(10=1050)(11=1500)(12=2000)(13=2500)(14=.)(99=.)
(rpincomes: 13086 changes made)

. gen spincomes = sincome

. recode spincomes (1=0)(2=12.5)(3=50)(4=112.5)(5=200)(6=300)(7=400)(8=525)(9=725)(10=1050)(11=1500)(12=2000)(13=2500)(14=.)(15=.)(
> 88=.)(99=.)
(spincomes: 13086 changes made)

. gen houseincomes = hincome

. recode houseincomes (1=0)(2=12.5)(3=50)(4=112.5)(5=200)(6=300)(7=400)(8=525)(9=725)(10=1050)(11=1500)(12=2000)(13=2500)(14=.)
(houseincomes: 11957 changes made)

. gen houseincomess = houseincomes*10000
(789 missing values generated)

. 
. gen rpincomess = rpincomes*10000
(655 missing values generated)

. gen spincomess = spincomes*10000
(1,137 missing values generated)

. gen rpincomesln = ln(rpincomes)
(2,754 missing values generated)

. 
. gen husincome = rpincomess 
(655 missing values generated)

. replace husincome = spincomess if sex == 2
(6,682 real changes made, 343 to missing)

. 
. gen wifincome = rpincomess 
(655 missing values generated)

. replace wifincome = spincomess if sex == 1
(4,963 real changes made, 341 to missing)

. 
. gen cpincome = husincome + wifincome
(1,339 missing values generated)

. gen raincome = wifincome / cpincome
(1,346 missing values generated)

. drop if husincome == . | wifincome == .
(1,339 observations deleted)

. 
. *Keep non-missing cases
. egen n_obs=count(id),by(id)

. keep if n_obs==7
(6,574 observations deleted)

. 
. *Job sequence
. gen jobflag = .
(5,173 missing values generated)

. recode jobflag . = 1 if wiftype  <= 3
(jobflag: 3339 changes made)

. /*正規*/
. gen jobflag_regular = .
(5,173 missing values generated)

. recode jobflag_regular . = 1 if wiftype == 1
(jobflag_regular: 1202 changes made)

. /*非正規*/
. gen jobflag_noregular = .
(5,173 missing values generated)

. recode jobflag_noregular . = 1 if wiftype == 2
(jobflag_noregular: 1952 changes made)

. 
. egen j_obs=count(jobflag),by(id)

. egen j_obsr=count(jobflag_regular),by(id)

. egen j_obsn=count(jobflag_noregular),by(id)

. 
. gen flag1 = 0

. replace flag1 = 1 if wiftype ~= 4 & wave == 1
(417 real changes made)

. gen flag2 = 0

. replace flag2 = 1 if wiftype ~= 4 & wave == 2
(432 real changes made)

. gen flag3 = 0

. replace flag3 = 1 if wiftype ~= 4 & wave == 3
(445 real changes made)

. gen flag4 = 0

. replace flag4 = 1 if wiftype ~= 4 & wave == 4
(481 real changes made)

. gen flag5 = 0

. replace flag5 = 1 if wiftype ~= 4 & wave == 5
(505 real changes made)

. gen flag6 = 0

. replace flag6 = 1 if wiftype ~= 4 & wave == 6
(521 real changes made)

. gen flag7 = 0

. replace flag7 = 1 if wiftype ~= 4 & wave == 6
(521 real changes made)

. 
. by id: generate wiftype1 = sum(flag1)

. by id: generate wiftype2 = sum(flag2)

. by id: generate wiftype3 = sum(flag3)

. by id: generate wiftype4 = sum(flag4)

. by id: generate wiftype5 = sum(flag5)

. by id: generate wiftype6 = sum(flag6)

. by id: generate wiftype7 = sum(flag7)

. 
. gen seq = 0 

. recode seq 0 = 1 if j_obsr == 7 & wiftype == 1 & wave == 7
(seq: 126 changes made)

. recode seq 0 = 2 if j_obsn == 7 & wiftype == 2 & wave == 7
(seq: 121 changes made)

. recode seq 0 = 3 if j_obs == 0 & wiftype == 4 & wave == 7
(seq: 111 changes made)

. recode seq 0 = 4 if wiftype1 == 0 & wiftype2 == 1 & wiftype3 == 1 & wiftype4 == 1 & wiftype5 == 1 & wiftype6 == 1 & wiftype7 == 1
>  & wave == 7
(seq: 33 changes made)

. recode seq 0 = 4 if wiftype1 == 0 & wiftype2 == 0 & wiftype3 == 1 & wiftype4 == 1 & wiftype5 == 1 & wiftype6 == 1 & wiftype7 == 1
>   & wave == 7
(seq: 25 changes made)

. recode seq 0 = 4 if wiftype1 == 0 & wiftype2 == 0 & wiftype3 == 0 & wiftype4 == 1 & wiftype5 == 1 & wiftype6 == 1 & wiftype7 == 1
>   & wave == 7
(seq: 31 changes made)

. recode seq 0 = 4 if wiftype1 == 0 & wiftype2 == 0 & wiftype3 == 0 & wiftype4 == 0 & wiftype5 == 1 & wiftype6 == 1 & wiftype7 == 1
>   & wave == 7
(seq: 25 changes made)

. recode seq 0 = 4 if wiftype1 == 0 & wiftype2 == 0 & wiftype3 == 0 & wiftype4 == 0 & wiftype5 == 0 & wiftype6 == 1 & wiftype7 == 1
>   & wave == 7
(seq: 21 changes made)

. recode seq 0 = 4 if wiftype1 == 0 & wiftype2 == 0 & wiftype3 == 0 & wiftype4 == 0 & wiftype5 == 0 & wiftype6 == 0 & wiftype7 == 1
>   & wave == 7
(seq: 0 changes made)

. recode seq 0 = 5 if wiftype1 == 1 & wiftype2 == 1 & wiftype3 == 1 & wiftype4 == 1 & wiftype5 == 1 & wiftype6 == 1 & wiftype7 == 0
>   & wave == 7
(seq: 0 changes made)

. recode seq 0 = 5 if wiftype1 == 1 & wiftype2 == 1 & wiftype3 == 1 & wiftype4 == 1 & wiftype5 == 1 & wiftype6 == 0 & wiftype7 == 0
>   & wave == 7
(seq: 6 changes made)

. recode seq 0 = 5 if wiftype1 == 1 & wiftype2 == 1 & wiftype3 == 1 & wiftype4 == 1 & wiftype5 == 0 & wiftype6 == 0 & wiftype7 == 0
>   & wave == 7
(seq: 7 changes made)

. recode seq 0 = 5 if wiftype1 == 1 & wiftype2 == 1 & wiftype3 == 1 & wiftype4 == 0 & wiftype5 == 0 & wiftype6 == 0 & wiftype7 == 0
>   & wave == 7
(seq: 4 changes made)

. recode seq 0 = 5 if wiftype1 == 1 & wiftype2 == 1 & wiftype3 == 0 & wiftype4 == 0 & wiftype5 == 0 & wiftype6 == 0 & wiftype7 == 0
>   & wave == 7
(seq: 10 changes made)

. recode seq 0 = 5 if wiftype1 == 1 & wiftype2 == 0 & wiftype3 == 0 & wiftype4 == 0 & wiftype5 == 0 & wiftype6 == 0 & wiftype7 == 0
>   & wave == 7
(seq: 14 changes made)

. recode seq 0 = 6 if wave == 7
(seq: 205 changes made)

. 
. by id: egen maxseq = max(seq)

. replace seq = maxseq if wave ==1
(739 real changes made)

. 
. by id: egen seq6 = sum(maxseq)

. recode seq6 7=1 14=2 21=3 28=4 35=5 42=6 
(seq6: 5173 changes made)

. label define seq6l 1 "正規継続" 2 "非正規継続" 3 "無職継続" 4"途中参入" 5"途中退出" 6"その他"

. label values seq6 seq6l

. 
. *30 patterns for Theil analysis
. gen seq_hom = 0

. recode seq_hom 0 = 1 if seq6 == 1 & hom == 1
(seq_hom: 137 changes made)

. recode seq_hom 0 = 2 if seq6 == 1 & hom == 2
(seq_hom: 129 changes made)

. recode seq_hom 0 = 3 if seq6 == 1 & hom == 3
(seq_hom: 221 changes made)

. recode seq_hom 0 = 4 if seq6 == 1 & hom == 4
(seq_hom: 231 changes made)

. recode seq_hom 0 = 5 if seq6 == 1 & hom == 5
(seq_hom: 164 changes made)

. recode seq_hom 0 = 6 if seq6 == 2 & hom == 1
(seq_hom: 220 changes made)

. recode seq_hom 0 = 7 if seq6 == 2 & hom == 2
(seq_hom: 105 changes made)

. recode seq_hom 0 = 8 if seq6 == 2 & hom == 3
(seq_hom: 63 changes made)

. recode seq_hom 0 = 9 if seq6 == 2 & hom == 4
(seq_hom: 287 changes made)

. recode seq_hom 0 = 10 if seq6 == 2 & hom == 5
(seq_hom: 172 changes made)

. recode seq_hom 0 = 11 if seq6 == 3 & hom == 1
(seq_hom: 87 changes made)

. recode seq_hom 0 = 12 if seq6 == 3 & hom == 2
(seq_hom: 59 changes made)

. recode seq_hom 0 = 13 if seq6 == 3 & hom == 3
(seq_hom: 210 changes made)

. recode seq_hom 0 = 14 if seq6 == 3 & hom == 4
(seq_hom: 330 changes made)

. recode seq_hom 0 = 15 if seq6 == 3 & hom == 5
(seq_hom: 91 changes made)

. recode seq_hom 0 = 16 if seq6 == 4 & hom == 1
(seq_hom: 157 changes made)

. recode seq_hom 0 = 17 if seq6 == 4 & hom == 2
(seq_hom: 89 changes made)

. recode seq_hom 0 = 18 if seq6 == 4 & hom == 3
(seq_hom: 126 changes made)

. recode seq_hom 0 = 19 if seq6 == 4 & hom == 4
(seq_hom: 392 changes made)

. recode seq_hom 0 = 20 if seq6 == 4 & hom == 5
(seq_hom: 181 changes made)

. recode seq_hom 0 = 21 if seq6 == 5 & hom == 1
(seq_hom: 53 changes made)

. recode seq_hom 0 = 22 if seq6 == 5 & hom == 2
(seq_hom: 21 changes made)

. recode seq_hom 0 = 23 if seq6 == 5 & hom == 3
(seq_hom: 53 changes made)

. recode seq_hom 0 = 24 if seq6 == 5 & hom == 4
(seq_hom: 111 changes made)

. recode seq_hom 0 = 25 if seq6 == 5 & hom == 5
(seq_hom: 49 changes made)

. recode seq_hom 0 = 26 if seq6 == 6 & hom == 1
(seq_hom: 218 changes made)

. recode seq_hom 0 = 27 if seq6 == 6 & hom == 2
(seq_hom: 147 changes made)

. recode seq_hom 0 = 28 if seq6 == 6 & hom == 3
(seq_hom: 248 changes made)

. recode seq_hom 0 = 29 if seq6 == 6 & hom == 4
(seq_hom: 528 changes made)

. recode seq_hom 0 = 30 if seq6 == 6 & hom == 5
(seq_hom: 294 changes made)

. 
. *Income variables
. gen husincome_year1 = husincome if wave == 1
(4,434 missing values generated)

. by id: generate cf_husincome = sum(husincome_year1)

. gen cf_cpincome = cf_husincome + wifincome

. gen cf_raincome = wifincome / cf_cpincome

. gen sq_husincome = husincome/sqrt(numberoffamily)

. gen sq_wifincome = wifincome/sqrt(numberoffamily)

. gen sq_cpincome = cpincome/sqrt(numberoffamily)

. gen sq_cf_husincome = cf_husincome/sqrt(numberoffamily)

. gen sq_cf_cpincome = cf_cpincome/sqrt(numberoffamily)

. 
end of do-file

. do "/Users/fumiyau/Documents/GitHub/JLPS-JSFS/3.Analysis.do"

. *Husband's income category
. gen huscat = husincome 

. recode huscat (0/3000000 = 1) (4000000=2) (5250000=3) (7250000=4) (10500000/25000000 = 5)
(huscat: 5173 changes made)

. gen huscat1 =. 
(5,173 missing values generated)

. replace huscat1 = huscat if wave == 1
(739 real changes made)

. by id: gen huscat1sum  = sum(huscat1)

. by id: gen huscatsum  = sum(husincome/7)

. by id: egen husincav = max(huscatsum)

. recode husincav (0/3500000 = 1) (3500001/4500000=2) (4500001/6000000=3) (6000001/8500000=4) (8500001/25000000 = 5)
(husincav: 5173 changes made)

. recode husincav 5=4,gen(husincavx) 
(476 differences between husincav and husincavx)

. *Labeling
. label define  husincavl 1 "0-350万円" 2 "350-450万円" 3 "450-600万円" 4 "600-850万円" 5 "850万円以上" 

. label values husincav husincavl

. label define  husincavxl 1 "0-350万円" 2 "350-450万円" 3 "450-600万円" 4 "600万円以上" 

. label values husincavx husincavxl 

. label define  wiftypel 1 "正規" 2 "非正規" 3 "自営・家族従業" 4 "無職" 

. label values wiftype wiftypel 

. *Create dummy variables
. drop wiftype1 wiftype2 wiftype3 wiftype4 wiftype5 wiftype6 wiftype7 husedu3 wifedu3

. tabulate husedu,gen(husedu)

     husedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,701       32.88       32.88
          2 |        841       16.26       49.14
          3 |        192        3.71       52.85
          4 |      2,439       47.15      100.00
------------+-----------------------------------
      Total |      5,173      100.00

. tabulate wifedu,gen(wifedu)

     wifedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,652       31.94       31.94
          2 |      1,032       19.95       51.88
          3 |      1,313       25.38       77.27
          4 |      1,176       22.73      100.00
------------+-----------------------------------
      Total |      5,173      100.00

. tabulate hustype,gen(hustype)

    hustype |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,615       89.21       89.21
          2 |        174        3.36       92.58
          3 |        352        6.80       99.38
          4 |         32        0.62      100.00
------------+-----------------------------------
      Total |      5,173      100.00

. tabulate wiftype,gen(wiftype)

       wiftype |      Freq.     Percent        Cum.
---------------+-----------------------------------
          正規 |      1,202       23.24       23.24
        非正規 |      1,952       37.73       60.97
自営・家族従業 |        185        3.58       64.55
          無職 |      1,834       35.45      100.00
---------------+-----------------------------------
         Total |      5,173      100.00

. tabulate seq6,gen(seq6)

       seq6 |      Freq.     Percent        Cum.
------------+-----------------------------------
   正規継続 |        882       17.05       17.05
 非正規継続 |        847       16.37       33.42
   無職継続 |        777       15.02       48.44
   途中参入 |        945       18.27       66.71
   途中退出 |        287        5.55       72.26
     その他 |      1,435       27.74      100.00
------------+-----------------------------------
      Total |      5,173      100.00

. tabulate homogamy,gen(homogamy)

    homogamy |      Freq.     Percent        Cum.
-------------+-----------------------------------
低学歴同類婚 |        872       16.86       16.86
中学歴同類婚 |        550       10.63       27.49
高学歴同類婚 |        921       17.80       45.29
    妻上昇婚 |      1,879       36.32       81.62
    妻下降婚 |        951       18.38      100.00
-------------+-----------------------------------
       Total |      5,173      100.00

. 
. *Table1
. cd "/Users/fumiyau/Documents/GitHub/JLPS-JSFS/Results/"
/Users/fumiyau/Documents/GitHub/JLPS-JSFS/Results

. quietly estpost tabstat husedu1 husedu2 husedu3 husedu4 wifedu1 wifedu2 wifedu3 wifedu4 hustype1 hustype2 hustype3 hustype4 wifty
> pe1 wiftype2 wiftype3 wiftype4 husincome wifincome wifage numchild seq61 seq62 seq63 seq64 seq65 seq66 homogamy1 homogamy2 homoga
> my3 homogamy4 homogamy5 if wave == 1, statistics(mean sd max min) columns(statistics)

. quietly esttab . using descwave1.csv, replace cells("mean(fmt(3)) sd(fmt(3)) min max(fmt(3))") noobs nonote label

. quietly estpost tabstat wiftype1 wiftype2 wiftype3 wiftype4 husincome wifincome  if wave == 7, statistics(mean sd max min) column
> s(statistics)

. quietly esttab . using descwave7.csv, replace cells("mean(fmt(3)) sd(fmt(3)) min max(fmt(3))") noobs nonote label

. 
. *Figure 1
. tab3way husincavx wiftype4 wave, rowpct


Table entries are cell frequencies and row percentages
Missing categories ignored

--------------------------------------------------------------------------------------------------------------------------
            |                                            wave and wiftype==無職                                           
RECODE of   | ----- 1 ----    ----- 2 ----    ----- 3 ----    ----- 4 ----    ----- 5 ----    ----- 6 ----    ----- 7 ----
husincav    |     0      1        0      1        0      1        0      1        0      1        0      1        0      1
------------+-------------------------------------------------------------------------------------------------------------
  0-350万円 |   100     65      106     59      117     48      122     43      128     37      133     32      135     30
            | 60.61  39.39    64.24  35.76    70.91  29.09    73.94  26.06    77.58  22.42    80.61  19.39    81.82  18.18
            | 
 350-450万 |    83     62       91     54       94     51      103     42      102     43      105     40      112     33
            | 57.24  42.76    62.76  37.24    64.83  35.17    71.03  28.97    70.34  29.66    72.41  27.59    77.24  22.76
            | 
 450-600万 |   112     80      118     74      119     73      130     62      134     58      138     54      142     50
            | 58.33  41.67    61.46  38.54    61.98  38.02    67.71  32.29    69.79  30.21    71.88  28.12    73.96  26.04
            | 
   600万円 |   122    115      117    120      115    122      126    111      141     96      145     92      149     88
            | 51.48  48.52    49.37  50.63    48.52  51.48    53.16  46.84    59.49  40.51    61.18  38.82    62.87  37.13
--------------------------------------------------------------------------------------------------------------------------

. 
. *Table 2
. ta husincav wiftype if wave ==1,row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                |                   wiftype
       husincav |      正規     非正規   自営・家       無職 |     Total
----------------+--------------------------------------------+----------
      0-350万円 |        44         51          5         65 |       165 
                |     26.67      30.91       3.03      39.39 |    100.00 
----------------+--------------------------------------------+----------
    350-450万円 |        26         50          7         62 |       145 
                |     17.93      34.48       4.83      42.76 |    100.00 
----------------+--------------------------------------------+----------
    450-600万円 |        48         57          7         80 |       192 
                |     25.00      29.69       3.65      41.67 |    100.00 
----------------+--------------------------------------------+----------
    600-850万円 |        41         53          1         74 |       169 
                |     24.26      31.36       0.59      43.79 |    100.00 
----------------+--------------------------------------------+----------
    850万円以上 |        14         10          3         41 |        68 
                |     20.59      14.71       4.41      60.29 |    100.00 
----------------+--------------------------------------------+----------
          Total |       173        221         23        322 |       739 
                |     23.41      29.91       3.11      43.57 |    100.00 


. 
. *Figure 2: Gini coefficients
. forvalues i=1/7{
  2. fastgini husincome if wave == `i'
  3. }

Warning: husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2495861

Gini coefficient = 0.2475096

Gini coefficient = 0.2390698

Warning: husincome has 1 values <= 0. Not used in calculations

Gini coefficient = 0.2415918

Warning: husincome has 1 values <= 0. Not used in calculations

Gini coefficient = 0.2442943

Warning: husincome has 1 values <= 0. Not used in calculations

Gini coefficient = 0.2463082

Warning: husincome has 1 values <= 0. Not used in calculations

Gini coefficient = 0.2524663

. forvalues i=1/7{
  2. fastgini wifincome if wave == `i'
  3. }

Warning: wifincome has 251 values <= 0. Not used in calculations

Gini coefficient = 0.4627628

Warning: wifincome has 256 values <= 0. Not used in calculations

Gini coefficient = 0.4752667

Warning: wifincome has 245 values <= 0. Not used in calculations

Gini coefficient = 0.4655423

Warning: wifincome has 228 values <= 0. Not used in calculations

Gini coefficient = 0.4639101

Warning: wifincome has 198 values <= 0. Not used in calculations

Gini coefficient = 0.4763146

Warning: wifincome has 198 values <= 0. Not used in calculations

Gini coefficient = 0.4604169

Warning: wifincome has 172 values <= 0. Not used in calculations

Gini coefficient = 0.4583250

. forvalues i=1/7{
  2. fastgini cpincome if wave == `i'
  3. }

Gini coefficient = 0.2570182

Gini coefficient = 0.2552358

Gini coefficient = 0.2437407

Gini coefficient = 0.2421619

Gini coefficient = 0.2431000

Gini coefficient = 0.2431909

Gini coefficient = 0.2476921

. forvalues i=1/7{
  2. fastgini sq_husincome if wave == `i'
  3. }

Warning: sq_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2710226

Gini coefficient = 0.2699990

Gini coefficient = 0.2634785

Warning: sq_husincome has 1 values <= 0. Not used in calculations

Gini coefficient = 0.2646100

Warning: sq_husincome has 1 values <= 0. Not used in calculations

Gini coefficient = 0.2685326

Warning: sq_husincome has 1 values <= 0. Not used in calculations

Gini coefficient = 0.2743798

Warning: sq_husincome has 1 values <= 0. Not used in calculations

Gini coefficient = 0.2782002

. forvalues i=1/7{
  2. fastgini sq_wifincome if wave == `i'
  3. }

Warning: sq_wifincome has 251 values <= 0. Not used in calculations

Gini coefficient = 0.4894205

Warning: sq_wifincome has 256 values <= 0. Not used in calculations

Gini coefficient = 0.5010013

Warning: sq_wifincome has 245 values <= 0. Not used in calculations

Gini coefficient = 0.4906770

Warning: sq_wifincome has 228 values <= 0. Not used in calculations

Gini coefficient = 0.4886935

Warning: sq_wifincome has 198 values <= 0. Not used in calculations

Gini coefficient = 0.5017445

Warning: sq_wifincome has 198 values <= 0. Not used in calculations

Gini coefficient = 0.4834789

Warning: sq_wifincome has 172 values <= 0. Not used in calculations

Gini coefficient = 0.4813533

. forvalues i=1/7{
  2. fastgini sq_cpincome if wave == `i'
  3. }

Gini coefficient = 0.2852653

Gini coefficient = 0.2809878

Gini coefficient = 0.2691565

Gini coefficient = 0.2669976

Gini coefficient = 0.2682996

Gini coefficient = 0.2709469

Gini coefficient = 0.2721465

. 
. *Counter factual analysis
. forvalues i=1/7{
  2. fastgini cf_husincome if wave == `i'
  3. }

Warning: cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2495861

Warning: cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2495861

Warning: cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2495861

Warning: cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2495861

Warning: cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2495861

Warning: cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2495861

Warning: cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2495861

. forvalues i=1/7{
  2. fastgini cf_cpincome if wave == `i'
  3. }

Gini coefficient = 0.2570182

Gini coefficient = 0.2575954

Gini coefficient = 0.2524412

Gini coefficient = 0.2522346

Gini coefficient = 0.2552639

Gini coefficient = 0.2518565

Gini coefficient = 0.2521943

. forvalues i=1/7{
  2. fastgini sq_cf_husincome if wave == `i'
  3. }

Warning: sq_cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2710226

Warning: sq_cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2718273

Warning: sq_cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2721860

Warning: sq_cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2704296

Warning: sq_cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2731600

Warning: sq_cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2767128

Warning: sq_cf_husincome has 2 values <= 0. Not used in calculations

Gini coefficient = 0.2755620

. forvalues i=1/7{
  2. fastgini sq_cf_cpincome if wave ==`i'
  3. }

Gini coefficient = 0.2852653

Gini coefficient = 0.2837875

Gini coefficient = 0.2768268

Gini coefficient = 0.2759002

Gini coefficient = 0.2792214

Gini coefficient = 0.2781971

Gini coefficient = 0.2763910

. 
. *Table 3: 
. *Descriptive stats
. mean(wifage) if wave == 1, over(homogamy)

Mean estimation                   Number of obs   =        737

 低学歴同類婚: homogamy = 低学歴同類婚
 中学歴同類婚: homogamy = 中学歴同類婚
 高学歴同類婚: homogamy = 高学歴同類婚
     妻上昇婚: homogamy = 妻上昇婚
     妻下降婚: homogamy = 妻下降婚

--------------------------------------------------------------
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
wifage       |
低学歴同類婚 |   34.69106   .4216787      33.86322    35.51889
中学歴同類婚 |   34.11538   .4383318      33.25485    34.97591
高学歴同類婚 |   33.38931    .359515      32.68352    34.09511
    妻上昇婚 |   34.33457   .2749478       33.7948    34.87435
    妻下降婚 |   33.21324   .3662517      32.49421    33.93226
--------------------------------------------------------------

. mean(husincome) if wave == 1, over(homogamy)

Mean estimation                   Number of obs   =        739

 低学歴同類婚: homogamy = 低学歴同類婚
 中学歴同類婚: homogamy = 中学歴同類婚
 高学歴同類婚: homogamy = 高学歴同類婚
     妻上昇婚: homogamy = 妻上昇婚
     妻下降婚: homogamy = 妻下降婚

--------------------------------------------------------------
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
husincome    |
低学歴同類婚 |    4376008   170183.4       4041907     4710109
中学歴同類婚 |    3961538     177090       3613878     4309199
高学歴同類婚 |    6166031   261390.7       5652873     6679188
    妻上昇婚 |    5373141   179325.6       5021092     5725190
    妻下降婚 |    4289234   149544.8       3995650     4582818
--------------------------------------------------------------

. mean(husincome) if wave == 7, over(homogamy)

Mean estimation                   Number of obs   =        739

 低学歴同類婚: homogamy = 低学歴同類婚
 中学歴同類婚: homogamy = 中学歴同類婚
 高学歴同類婚: homogamy = 高学歴同類婚
     妻上昇婚: homogamy = 妻上昇婚
     妻下降婚: homogamy = 妻下降婚

--------------------------------------------------------------
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
husincome    |
低学歴同類婚 |    4566000     158366       4255098     4876902
中学歴同類婚 |    4696203   314493.3       4078794     5313611
高学歴同類婚 |    6921402   272609.9       6386218     7456585
    妻上昇婚 |    6044310   190294.2       5670727     6417892
    妻下降婚 |    4788889     167795       4459476     5118301
--------------------------------------------------------------

. mean(wifincome) if wave == 1, over(homogamy)

Mean estimation                   Number of obs   =        739

 低学歴同類婚: homogamy = 低学歴同類婚
 中学歴同類婚: homogamy = 中学歴同類婚
 高学歴同類婚: homogamy = 高学歴同類婚
     妻上昇婚: homogamy = 妻上昇婚
     妻下降婚: homogamy = 妻下降婚

--------------------------------------------------------------
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
wifincome    |
低学歴同類婚 |    1108871   119124.7      875007.3     1342735
中学歴同類婚 |    1511218   183693.4       1150594     1871842
高学歴同類婚 |    1743321   185989.5       1378189     2108452
    妻上昇婚 |    1111989   125238.3      866123.1     1357855
    妻下降婚 |    1516423   151782.8       1218446     1814401
--------------------------------------------------------------

. mean(wifincome) if wave == 7, over(homogamy)

Mean estimation                   Number of obs   =        739

 低学歴同類婚: homogamy = 低学歴同類婚
 中学歴同類婚: homogamy = 中学歴同類婚
 高学歴同類婚: homogamy = 高学歴同類婚
     妻上昇婚: homogamy = 妻上昇婚
     妻下降婚: homogamy = 妻下降婚

--------------------------------------------------------------
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
wifincome    |
低学歴同類婚 |    1367000   119977.7       1131462     1602538
中学歴同類婚 |    1767405   196564.7       1381512     2153298
高学歴同類婚 |    1941288   212595.7       1523924     2358652
    妻上昇婚 |    1210821   93800.55       1026673     1394969
    妻下降婚 |    1676852   152022.4       1378404     1975300
--------------------------------------------------------------

. tab seq6 homogamy if wave == 1,col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |                        homogamy
           seq6 |  低学歴同   中学歴同   高学歴同   妻上昇婚   妻下降婚 |     Total
----------------+-------------------------------------------------------+----------
       正規継続 |        19         19         31         33         24 |       126 
                |     15.32      24.36      23.66      12.27      17.52 |     17.05 
----------------+-------------------------------------------------------+----------
     非正規継続 |        32         15          9         41         24 |       121 
                |     25.81      19.23       6.87      15.24      17.52 |     16.37 
----------------+-------------------------------------------------------+----------
       無職継続 |        13          9         30         46         13 |       111 
                |     10.48      11.54      22.90      17.10       9.49 |     15.02 
----------------+-------------------------------------------------------+----------
       途中参入 |        23         11         18         56         27 |       135 
                |     18.55      14.10      13.74      20.82      19.71 |     18.27 
----------------+-------------------------------------------------------+----------
       途中退出 |         7          3          7         17          7 |        41 
                |      5.65       3.85       5.34       6.32       5.11 |      5.55 
----------------+-------------------------------------------------------+----------
         その他 |        30         21         36         76         42 |       205 
                |     24.19      26.92      27.48      28.25      30.66 |     27.74 
----------------+-------------------------------------------------------+----------
          Total |       124         78        131        269        137 |       739 
                |    100.00     100.00     100.00     100.00     100.00 |    100.00 


. mean(numchild) if wave == 1, over(homogamy)

Mean estimation                   Number of obs   =        739

 低学歴同類婚: homogamy = 低学歴同類婚
 中学歴同類婚: homogamy = 中学歴同類婚
 高学歴同類婚: homogamy = 高学歴同類婚
     妻上昇婚: homogamy = 妻上昇婚
     妻下降婚: homogamy = 妻下降婚

--------------------------------------------------------------
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
numchild     |
低学歴同類婚 |   1.790323   .0827933      1.627784    1.952861
中学歴同類婚 |        1.5   .1091089      1.285799    1.714201
高学歴同類婚 |   1.290076   .0821672      1.128767    1.451386
    妻上昇婚 |   1.568773   .0574546      1.455979    1.681567
    妻下降婚 |   1.437956   .0767394      1.287303     1.58861
--------------------------------------------------------------

. mean(numchild) if wave == 7, over(homogamy)

Mean estimation                   Number of obs   =        739

 低学歴同類婚: homogamy = 低学歴同類婚
 中学歴同類婚: homogamy = 中学歴同類婚
 高学歴同類婚: homogamy = 高学歴同類婚
     妻上昇婚: homogamy = 妻上昇婚
     妻下降婚: homogamy = 妻下降婚

--------------------------------------------------------------
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
numchild     |
低学歴同類婚 |      2.008   .0757722      1.859245    2.156755
中学歴同類婚 |   1.974684   .1095485       1.75962    2.189747
高学歴同類婚 |   1.856061   .0738334      1.711112    2.001009
    妻上昇婚 |   1.940299   .0570685      1.828263    2.052335
    妻下降婚 |   1.844444   .0749916      1.697222    1.991667
--------------------------------------------------------------

. 
. *Table 4: Theil index
. ineqdeco cpincome if wave == 1, bygroup(seq_hom)
 
Percentile ratios

----------------------------------------------------------
  All obs |    p90/p10     p90/p50     p10/p50     p75/p25
----------+-----------------------------------------------
          |      3.360       1.953       0.581       1.788
----------------------------------------------------------
  
Generalized Entropy indices GE(a), where a = income difference
 sensitivity parameter, and Gini coefficient

----------------------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)        Gini
----------+-----------------------------------------------------------
          |    0.12928     0.11186     0.11573     0.14574     0.25702
----------------------------------------------------------------------
   
Atkinson indices, A(e), where e > 0 is the inequality aversion parameter

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.05492     0.10583     0.20544
----------------------------------------------
  
Subgroup summary statistics, for each subgroup k = 1,...,K:
  

------------------------------------------------------------------------------------------
  seq_hom |    Popn. share            Mean   Relative mean    Income share       log(mean)
----------+-------------------------------------------------------------------------------
        1 |        0.02571   7815789.47368         1.23337         0.03171        15.87166
        2 |        0.02571   6934210.52632         1.09425         0.02813        15.75198
        3 |        0.04195  11141129.03226         1.75812         0.07375        16.22615
        4 |        0.04465   9757575.75758         1.53979         0.06876        16.09355
        5 |        0.03248   9104166.66667         1.43668         0.04666        16.02424
        6 |        0.04330   5394531.25000         0.85128         0.03686        15.50090
        7 |        0.02030   5408333.33333         0.85346         0.01732        15.50345
        8 |        0.01218   6055555.55556         0.95560         0.01164        15.61649
        9 |        0.05548   6143292.68293         0.96944         0.05378        15.63087
       10 |        0.03248   5281250.00000         0.83341         0.02707        15.47967
       11 |        0.01759   4038461.53846         0.63729         0.01121        15.21137
       12 |        0.01218   4083333.33333         0.64437         0.00785        15.22242
       13 |        0.04060   6383333.33333         1.00732         0.04089        15.66920
       14 |        0.06225   6317934.78261         0.99700         0.06206        15.65890
       15 |        0.01759   4336538.46154         0.68433         0.01204        15.28259
       16 |        0.03112   4456521.73913         0.70326         0.02189        15.30988
       17 |        0.01488   5409090.90909         0.85358         0.01271        15.50359
       18 |        0.02436   7194444.44444         1.13532         0.02765        15.78882
       19 |        0.07578   5158482.14286         0.81403         0.06169        15.45615
       20 |        0.03654   4601851.85185         0.72619         0.02653        15.34197
       21 |        0.00947   4303571.42857         0.67912         0.00643        15.27496
       22 |        0.00406   5833333.33333         0.92053         0.00374        15.57910
       23 |        0.00947   7678571.42857         1.21172         0.01148        15.85394
       24 |        0.02300   7242647.05882         1.14292         0.02629        15.79550
       25 |        0.00947   5160714.28571         0.81439         0.00771        15.45659
       26 |        0.04060   5795833.33333         0.91461         0.03713        15.57265
       27 |        0.02842   4773809.52381         0.75333         0.02141        15.37866
       28 |        0.04871   7263888.88889         1.14628         0.05584        15.79843
       29 |        0.10284   6157894.73684         0.97175         0.09994        15.63325
       30 |        0.05683   5556547.61905         0.87685         0.04983        15.53049
------------------------------------------------------------------------------------------
  
Subgroup indices: GE_k(a) and Gini_k 

----------------------------------------------------------------------
  seq_hom |     GE(-1)       GE(0)       GE(1)       GE(2)        Gini
----------+-----------------------------------------------------------
        1 |    0.06576     0.05832     0.05533     0.05577     0.18173
        2 |    0.04218     0.04200     0.04338     0.04649     0.15909
        3 |    0.08157     0.08058     0.08498     0.09573     0.22306
        4 |    0.13236     0.14198     0.18495     0.30699     0.28148
        5 |    0.08564     0.07107     0.06644     0.06786     0.19765
        6 |    0.08058     0.07391     0.07276     0.07697     0.21002
        7 |    0.04499     0.04333     0.04306     0.04410     0.16394
        8 |    0.03830     0.03728     0.03708     0.03769     0.15240
        9 |    0.13948     0.11923     0.11474     0.12272     0.26688
       10 |    0.04465     0.04312     0.04309     0.04457     0.16552
       11 |    0.11474     0.09054     0.07911     0.07512     0.21538
       12 |    0.05762     0.05512     0.05546     0.05862     0.17838
       13 |    0.05780     0.05579     0.05613     0.05872     0.18316
       14 |    0.07477     0.07173     0.07245     0.07682     0.20934
       15 |    0.05389     0.05687     0.06292     0.07340     0.18318
       16 |    0.05519     0.05494     0.05631     0.05947     0.18590
       17 |    0.10594     0.10670     0.11484     0.13274     0.25936
       18 |    0.09716     0.08739     0.08428     0.08674     0.22855
       19 |    0.18106     0.11499     0.09882     0.10218     0.23451
       20 |    0.08020     0.07817     0.08198     0.09242     0.21768
       21 |    0.03696     0.03616     0.03608     0.03674     0.15056
       22 |    0.06471     0.05953     0.05652     0.05531     0.18095
       23 |    0.06403     0.06093     0.05983     0.06057     0.19402
       24 |    0.13089     0.11516     0.11876     0.14237     0.24903
       25 |    0.05958     0.05976     0.06249     0.06820     0.19278
       26 |    0.05781     0.06167     0.06982     0.08462     0.19255
       27 |    0.04824     0.04624     0.04601     0.04749     0.17053
       28 |    0.05818     0.05274     0.05003     0.04939     0.17872
       29 |    0.15746     0.12181     0.11142     0.11582     0.26051
       30 |    0.10370     0.08140     0.07374     0.07366     0.21077
----------------------------------------------------------------------
  
Within-group inequality, GE_W(a)

----------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)
----------+-----------------------------------------------
          |    0.10024     0.08206     0.08434     0.11173
----------------------------------------------------------
              
Between-group inequality, GE_B(a):

----------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)
----------+-----------------------------------------------
          |    0.02904     0.02980     0.03140     0.03401
----------------------------------------------------------
              
Subgroup Atkinson indices, A_k(e)

----------------------------------------------
  seq_hom |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
        1 |    0.02798     0.05665     0.11623
        2 |    0.02113     0.04113     0.07779
        3 |    0.04062     0.07742     0.14026
        4 |    0.07726     0.13236     0.20931
        5 |    0.03363     0.06860     0.14624
        6 |    0.03601     0.07125     0.13880
        7 |    0.02140     0.04241     0.08254
        8 |    0.01845     0.03660     0.07115
        9 |    0.05685     0.11240     0.21811
       10 |    0.02135     0.04221     0.08199
       11 |    0.04139     0.08656     0.18665
       12 |    0.02728     0.05363     0.10333
       13 |    0.02765     0.05426     0.10363
       14 |    0.03550     0.06922     0.13008
       15 |    0.02950     0.05528     0.09729
       16 |    0.02752     0.05346     0.09940
       17 |    0.05412     0.10120     0.17483
       18 |    0.04210     0.08368     0.16271
       19 |    0.05115     0.10862     0.26585
       20 |    0.03927     0.07519     0.13822
       21 |    0.01793     0.03551     0.06883
       22 |    0.02868     0.05779     0.11458
       23 |    0.02985     0.05912     0.11353
       24 |    0.05653     0.10877     0.20747
       25 |    0.03016     0.05801     0.10648
       26 |    0.03228     0.05981     0.10365
       27 |    0.02282     0.04519     0.08799
       28 |    0.02538     0.05137     0.10423
       29 |    0.05640     0.11469     0.23949
       30 |    0.03781     0.07817     0.17178
----------------------------------------------
  
Within-group inequality, A_W(e)

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.04083     0.07982     0.15660
----------------------------------------------
 
Between-group inequality, A_B(e)

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.01468     0.02827     0.05790
----------------------------------------------

. *within 0.08434, between 0.03140
. ineqdeco cpincome if wave == 7, bygroup(seq_hom)
 
Percentile ratios

----------------------------------------------------------
  All obs |    p90/p10     p90/p50     p10/p50     p75/p25
----------+-----------------------------------------------
          |      2.750       1.725       0.627       1.634
----------------------------------------------------------
  
Generalized Entropy indices GE(a), where a = income difference
 sensitivity parameter, and Gini coefficient

----------------------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)        Gini
----------+-----------------------------------------------------------
          |    0.13459     0.10496     0.10361     0.11733     0.24769
----------------------------------------------------------------------
   
Atkinson indices, A(e), where e > 0 is the inequality aversion parameter

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.05049     0.09964     0.21209
----------------------------------------------
  
Subgroup summary statistics, for each subgroup k = 1,...,K:
  

------------------------------------------------------------------------------------------
  seq_hom |    Popn. share            Mean   Relative mean    Income share       log(mean)
----------+-------------------------------------------------------------------------------
        1 |        0.02706   8350000.00000         1.17775         0.03187        15.93777
        2 |        0.02436   8083333.33333         1.14013         0.02777        15.90531
        3 |        0.04330  12652343.75000         1.78458         0.07728        16.35335
        4 |        0.04465   9310606.06061         1.31324         0.05864        16.04666
        5 |        0.03112   9918478.26087         1.39898         0.04354        16.10991
        6 |        0.04195   5842741.93548         0.82410         0.03457        15.58071
        7 |        0.02030   5616666.66667         0.79222         0.01608        15.54125
        8 |        0.01218   7361111.11111         1.03827         0.01264        15.81172
        9 |        0.05548   7125000.00000         1.00496         0.05576        15.77912
       10 |        0.03383   6270000.00000         0.88437         0.02992        15.65129
       11 |        0.01624   4604166.66667         0.64941         0.01055        15.34247
       12 |        0.01083   5015625.00000         0.70744         0.00766        15.42807
       13 |        0.04060   7212500.00000         1.01730         0.04130        15.79133
       14 |        0.06495   7229166.66667         1.01965         0.06623        15.79363
       15 |        0.01759   4711538.46154         0.66455         0.01169        15.36553
       16 |        0.02977   5187500.00000         0.73168         0.02178        15.46176
       17 |        0.01894   6089285.71429         0.85888         0.01627        15.62204
       18 |        0.02436   8847222.22222         1.24788         0.03039        15.99561
       19 |        0.07578   6399553.57143         0.90264         0.06840        15.67174
       20 |        0.03383   5435000.00000         0.76659         0.02593        15.50837
       21 |        0.01083   4328125.00000         0.61047         0.00661        15.28064
       22 |        0.00406  10708333.33333         1.51038         0.00613        16.18653
       23 |        0.01083   6546875.00000         0.92342         0.01000        15.69450
       24 |        0.02030   6816666.66667         0.96147         0.01952        15.73488
       25 |        0.00947   4732142.85714         0.66746         0.00632        15.36989
       26 |        0.04330   5921875.00000         0.83526         0.03617        15.59416
       27 |        0.02842   5875000.00000         0.82865         0.02355        15.58622
       28 |        0.04736   7735714.28571         1.09110         0.05168        15.86136
       29 |        0.10149   7165000.00000         1.01060         0.10256        15.78472
       30 |        0.05683   6136904.76190         0.86559         0.04919        15.62983
------------------------------------------------------------------------------------------
  
Subgroup indices: GE_k(a) and Gini_k 

----------------------------------------------------------------------
  seq_hom |     GE(-1)       GE(0)       GE(1)       GE(2)        Gini
----------+-----------------------------------------------------------
        1 |    0.03771     0.03639     0.03604     0.03659     0.15090
        2 |    0.04090     0.04151     0.04337     0.04671     0.16247
        3 |    0.07700     0.07540     0.07874     0.08847     0.21616
        4 |    0.07898     0.07328     0.07238     0.07625     0.21160
        5 |    0.04615     0.04097     0.03839     0.03767     0.15133
        6 |    0.03920     0.03548     0.03321     0.03207     0.14070
        7 |    0.03407     0.03582     0.03878     0.04330     0.14461
        8 |    0.05452     0.04863     0.04498     0.04311     0.15807
        9 |    0.12073     0.11303     0.11848     0.13910     0.26154
       10 |    0.06151     0.05602     0.05470     0.05688     0.17863
       11 |    0.14300     0.11128     0.09831     0.09520     0.23416
       12 |    0.04312     0.04172     0.04146     0.04227     0.15849
       13 |    0.07388     0.06828     0.06666     0.06855     0.20067
       14 |    0.08754     0.08252     0.08445     0.09432     0.21997
       15 |    0.12916     0.08724     0.06871     0.06066     0.18587
       16 |    0.03852     0.03770     0.03799     0.03940     0.15468
       17 |    0.07739     0.06790     0.06317     0.06190     0.19837
       18 |    0.07846     0.07508     0.07630     0.08203     0.21158
       19 |    0.31232     0.13186     0.10739     0.11387     0.24476
       20 |    0.07984     0.08027     0.08632     0.09943     0.22219
       21 |    0.06110     0.05116     0.04479     0.04076     0.15569
       22 |    0.59896     0.45950     0.41849     0.44623     0.45655
       23 |    0.08712     0.06936     0.05997     0.05573     0.17572
       24 |    0.05010     0.04847     0.04841     0.04988     0.17099
       25 |    0.02334     0.02501     0.02723     0.03015     0.11321
       26 |    0.22588     0.14579     0.13084     0.14365     0.27494
       27 |    0.06982     0.06084     0.05852     0.06144     0.18034
       28 |    0.06610     0.05381     0.04823     0.04630     0.17000
       29 |    0.12180     0.10810     0.10778     0.11959     0.25432
       30 |    0.06891     0.06309     0.06213     0.06500     0.19489
----------------------------------------------------------------------
  
Within-group inequality, GE_W(a)

----------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)
----------+-----------------------------------------------
          |    0.10941     0.07919     0.07649     0.08795
----------------------------------------------------------
              
Between-group inequality, GE_B(a):

----------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)
----------+-----------------------------------------------
          |    0.02518     0.02577     0.02712     0.02938
----------------------------------------------------------
              
Subgroup Atkinson indices, A_k(e)

----------------------------------------------
  seq_hom |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
        1 |    0.01797     0.03574     0.07014
        2 |    0.02102     0.04066     0.07561
        3 |    0.03783     0.07263     0.13344
        4 |    0.03580     0.07066     0.13642
        5 |    0.01961     0.04014     0.08450
        6 |    0.01702     0.03486     0.07270
        7 |    0.01848     0.03519     0.06380
        8 |    0.02314     0.04746     0.09831
        9 |    0.05624     0.10688     0.19450
       10 |    0.02726     0.05448     0.10954
       11 |    0.05093     0.10531     0.22239
       12 |    0.02062     0.04086     0.07939
       13 |    0.03323     0.06600     0.12874
       14 |    0.04088     0.07921     0.14900
       15 |    0.03771     0.08354     0.20529
       16 |    0.01877     0.03700     0.07154
       17 |    0.03226     0.06565     0.13404
       18 |    0.03721     0.07233     0.13564
       19 |    0.05593     0.12353     0.38448
       20 |    0.04084     0.07714     0.13769
       21 |    0.02367     0.04988     0.10889
       22 |    0.20320     0.36840     0.54502
       23 |    0.03168     0.06701     0.14838
       24 |    0.02398     0.04732     0.09108
       25 |    0.01298     0.02470     0.04460
       26 |    0.06585     0.13566     0.31118
       27 |    0.02927     0.05903     0.12252
       28 |    0.02506     0.05238     0.11676
       29 |    0.05252     0.10246     0.19588
       30 |    0.03081     0.06114     0.12113
----------------------------------------------
  
Within-group inequality, A_W(e)

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.03786     0.07548     0.15733
----------------------------------------------
 
Between-group inequality, A_B(e)

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.01313     0.02613     0.06499
----------------------------------------------

. *within 0.07649, between 0.02712
. ineqdeco cf_cpincome if wave == 7, bygroup(seq_hom)
 
Percentile ratios

----------------------------------------------------------
  All obs |    p90/p10     p90/p50     p10/p50     p75/p25
----------+-----------------------------------------------
          |      3.360       1.826       0.543       1.939
----------------------------------------------------------
  
Generalized Entropy indices GE(a), where a = income difference
 sensitivity parameter, and Gini coefficient

----------------------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)        Gini
----------+-----------------------------------------------------------
          |    0.11764     0.10529     0.10723     0.12420     0.25219
----------------------------------------------------------------------
   
Atkinson indices, A(e), where e > 0 is the inequality aversion parameter

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.05163     0.09994     0.19047
----------------------------------------------
  
Subgroup summary statistics, for each subgroup k = 1,...,K:
  

------------------------------------------------------------------------------------------
  seq_hom |    Popn. share            Mean   Relative mean    Income share       log(mean)
----------+-------------------------------------------------------------------------------
        1 |        0.02706   7925000.00000         1.21758         0.03295        15.88553
        2 |        0.02436   7506944.44444         1.15335         0.02809        15.83134
        3 |        0.04330  12007812.50000         1.84486         0.07989        16.30107
        4 |        0.04465   9333333.33333         1.43396         0.06403        16.04910
        5 |        0.03112   9331521.73913         1.43368         0.04462        16.04891
        6 |        0.04195   5463709.67742         0.83943         0.03521        15.51364
        7 |        0.02030   5641666.66667         0.86678         0.01759        15.54569
        8 |        0.01218   6444444.44444         0.99011         0.01206        15.67873
        9 |        0.05548   6509146.34146         1.00005         0.05548        15.68872
       10 |        0.03383   5660000.00000         0.86959         0.02942        15.54893
       11 |        0.01624   3687500.00000         0.56654         0.00920        15.12046
       12 |        0.01083   4328125.00000         0.66497         0.00720        15.28064
       13 |        0.04060   6370833.33333         0.97880         0.03973        15.66724
       14 |        0.06495   6119791.66667         0.94023         0.06107        15.62704
       15 |        0.01759   4490384.61538         0.68989         0.01214        15.31745
       16 |        0.02977   5426136.36364         0.83366         0.02482        15.50674
       17 |        0.01894   5803571.42857         0.89165         0.01689        15.57398
       18 |        0.02436   8069444.44444         1.23978         0.03020        15.90360
       19 |        0.07578   5671875.00000         0.87142         0.06603        15.55103
       20 |        0.03383   5200000.00000         0.79892         0.02703        15.46417
       21 |        0.01083   3484375.00000         0.53533         0.00580        15.06380
       22 |        0.00406   4541666.66667         0.69777         0.00283        15.32880
       23 |        0.01083   6171875.00000         0.94824         0.01027        15.63551
       24 |        0.02030   6083333.33333         0.93463         0.01897        15.62106
       25 |        0.00947   3553571.42857         0.54596         0.00517        15.08346
       26 |        0.04330   5777343.75000         0.88762         0.03844        15.56945
       27 |        0.02842   5184523.80952         0.79654         0.02264        15.46119
       28 |        0.04736   6735714.28571         1.03486         0.04901        15.72293
       29 |        0.10149   6580000.00000         1.01094         0.10260        15.69955
       30 |        0.05683   5797619.04762         0.89074         0.05062        15.57296
------------------------------------------------------------------------------------------
  
Subgroup indices: GE_k(a) and Gini_k 

----------------------------------------------------------------------
  seq_hom |     GE(-1)       GE(0)       GE(1)       GE(2)        Gini
----------+-----------------------------------------------------------
        1 |    0.04098     0.04070     0.04141     0.04314     0.16120
        2 |    0.04944     0.04947     0.05178     0.05675     0.17324
        3 |    0.09298     0.09025     0.09470     0.10810     0.23701
        4 |    0.08560     0.08479     0.09185     0.10992     0.22585
        5 |    0.08724     0.07235     0.06439     0.06103     0.19534
        6 |    0.07126     0.06864     0.06936     0.07377     0.20669
        7 |    0.03843     0.03674     0.03616     0.03655     0.14948
        8 |    0.04139     0.03930     0.03820     0.03796     0.15469
        9 |    0.11287     0.10344     0.10309     0.11127     0.25382
       10 |    0.04738     0.04303     0.04092     0.04053     0.15880
       11 |    0.09849     0.07860     0.06820     0.06325     0.19633
       12 |    0.03763     0.03858     0.04073     0.04431     0.14937
       13 |    0.07339     0.06986     0.06986     0.07312     0.20573
       14 |    0.09416     0.08664     0.08621     0.09223     0.22730
       15 |    0.04891     0.04860     0.04974     0.05248     0.17328
       16 |    0.04855     0.04809     0.04912     0.05176     0.17520
       17 |    0.04672     0.04682     0.04851     0.05205     0.17363
       18 |    0.10335     0.08272     0.07109     0.06496     0.20319
       19 |    0.10203     0.08233     0.07676     0.08037     0.21071
       20 |    0.05875     0.05906     0.06308     0.07165     0.18638
       21 |    0.03828     0.03628     0.03560     0.03611     0.14406
       22 |    0.03732     0.03376     0.03100     0.02887     0.11621
       23 |    0.06675     0.06646     0.06946     0.07629     0.20158
       24 |    0.14584     0.14263     0.16358     0.22044     0.28201
       25 |    0.04199     0.03871     0.03693     0.03639     0.14932
       26 |    0.13189     0.10520     0.10123     0.11280     0.23903
       27 |    0.07514     0.06369     0.05821     0.05679     0.18599
       28 |    0.07326     0.06321     0.05880     0.05798     0.19130
       29 |    0.13806     0.10982     0.10158     0.10592     0.24729
       30 |    0.07450     0.06828     0.06747     0.07121     0.20204
----------------------------------------------------------------------
  
Within-group inequality, GE_W(a)

----------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)
----------+-----------------------------------------------
          |    0.08885     0.07603     0.07636     0.09041
----------------------------------------------------------
              
Between-group inequality, GE_B(a):

----------------------------------------------------------
  All obs |     GE(-1)       GE(0)       GE(1)       GE(2)
----------+-----------------------------------------------
          |    0.02879     0.02927     0.03087     0.03378
----------------------------------------------------------
              
Subgroup Atkinson indices, A_k(e)

----------------------------------------------
  seq_hom |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
        1 |    0.02036     0.03989     0.07576
        2 |    0.02500     0.04826     0.08999
        3 |    0.04524     0.08630     0.15680
        4 |    0.04313     0.08130     0.14618
        5 |    0.03356     0.06980     0.14856
        6 |    0.03399     0.06634     0.12475
        7 |    0.01808     0.03607     0.07137
        8 |    0.01923     0.03854     0.07645
        9 |    0.05046     0.09827     0.18416
       10 |    0.02076     0.04211     0.08656
       11 |    0.03594     0.07559     0.16456
       12 |    0.01965     0.03785     0.07000
       13 |    0.03442     0.06748     0.12799
       14 |    0.04235     0.08299     0.15848
       15 |    0.02434     0.04744     0.08911
       16 |    0.02406     0.04695     0.08850
       17 |    0.02359     0.04574     0.08545
       18 |    0.03766     0.07939     0.17130
       19 |    0.03874     0.07903     0.16948
       20 |    0.03006     0.05735     0.10514
       21 |    0.01781     0.03563     0.07112
       22 |    0.01608     0.03320     0.06946
       23 |    0.03348     0.06430     0.11777
       24 |    0.07345     0.13292     0.22581
       25 |    0.01874     0.03797     0.07748
       26 |    0.04993     0.09986     0.20872
       27 |    0.02995     0.06170     0.13064
       28 |    0.03000     0.06125     0.12779
       29 |    0.05127     0.10401     0.21637
       30 |    0.03336     0.06600     0.12968
----------------------------------------------
  
Within-group inequality, A_W(e)

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.03763     0.07434     0.14609
----------------------------------------------
 
Between-group inequality, A_B(e)

----------------------------------------------
  All obs |     A(0.5)        A(1)        A(2)
----------+-----------------------------------
          |    0.01454     0.02766     0.05197
----------------------------------------------

. *within 0.07636, between 0.03087
. 
. *Figure 3
. bysort seq6: sum husincome wifincome cpincome if wave ==1 & homogamy==3

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 正規継続

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |         31     6596774     4660864    2000000   2.50e+07
   wifincome |         31     4544355     1522248    1125000    7250000
    cpincome |         31    1.11e+07     4955504    5000000   2.61e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 非正規継続

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |          9     4805556     1694558    3000000    7250000
   wifincome |          9     1250000     1187500     125000    4000000
    cpincome |          9     6055556     1763465    4125000    9250000

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 無職継続

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |         30     6375000     2233898    3000000   1.05e+07
   wifincome |         30    8333.333    31713.52          0     125000
    cpincome |         30     6383333     2224940    3000000   1.05e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 途中参入

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |         18     6597222     2575534    3000000   1.05e+07
   wifincome |         18    597222.2     1714212          0    7250000
    cpincome |         18     7194444     3083466    3000000   1.45e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 途中退出

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |          7     6071429     2498809    3000000   1.05e+07
   wifincome |          7     1607143     1221399     500000    4000000
    cpincome |          7     7678571     2886622    4500000   1.16e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = その他

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |         36     5763889     2144715    2000000   1.05e+07
   wifincome |         36     1500000     1583396          0    5250000
    cpincome |         36     7263889     2315279    3000000   1.16e+07


. bysort seq6: sum husincome wifincome cpincome if wave ==7 & homogamy==3

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 正規継続

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |         32     7261719     4256916    1125000   2.50e+07
   wifincome |         32     5390625     2097365    2000000   1.05e+07
    cpincome |         32    1.27e+07     5407277    6000000   3.23e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 非正規継続

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |          9     5722222     1926154    3000000    7250000
   wifincome |          9     1638889      963077    1125000    4000000
    cpincome |          9     7361111     2292519    4125000   1.13e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 無職継続

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |         30     7075000     2434619    3000000   1.05e+07
   wifincome |         30      137500    729866.2          0    4000000
    cpincome |         30     7212500     2716320    3000000   1.45e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 途中参入

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |         18     7375000     3905360    4000000   1.50e+07
   wifincome |         18     1472222     1426866     125000    4000000
    cpincome |         18     8847222     3687358    4125000   1.61e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = 途中退出

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |          8     6187500     2678452    2000000   1.05e+07
   wifincome |          8      359375    501949.3          0    1125000
    cpincome |          8     6546875     2336566    2500000   1.05e+07

-----------------------------------------------------------------------------------------------------------------------------------
-> seq6 = その他

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   husincome |         35     6721429     2335603    2000000   1.05e+07
   wifincome |         35     1014286     1245127          0    5250000
    cpincome |         35     7735714     2388463    2125000   1.35e+07


. 
. 
. 
end of do-file

. log close
      name:  <unnamed>
       log:  /Users/fumiyau/Documents/GitHub/JLPS-JSFS/JLPS_JSFS.log
  log type:  text
 closed on:   1 Oct 2018, 16:57:17
-----------------------------------------------------------------------------------------------------------------------------------
